In [10]:
import pandas as pd
from sklearn import tree
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split

In [11]:
df = pd.read_csv('titanic.csv')

In [12]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [13]:
df2 = df.copy()

In [14]:
df2.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis = 'columns',inplace = True)

In [15]:
df2.columns

Index(['Survived', 'Pclass', 'Sex', 'Age', 'Fare'], dtype='object')

In [16]:
target = df2.Survived
target.head(5)

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [17]:
inputs = df2.drop(columns = 'Survived')
inputs

     Pclass     Sex   Age     Fare
0         3    male  22.0   7.2500
1         1  female  38.0  71.2833
2         3  female  26.0   7.9250
3         1  female  35.0  53.1000
4         3    male  35.0   8.0500
..      ...     ...   ...      ...
886       2    male  27.0  13.0000
887       1  female  19.0  30.0000
888       3  female   NaN  23.4500
889       1    male  26.0  30.0000
890       3    male  32.0   7.7500

[891 rows x 4 columns]

In [18]:
le = LabelEncoder()

In [19]:
inputs.Sex = le.fit_transform(inputs.Sex)

In [20]:
inputs.Sex.head(5)

0    1
1    0
2    0
3    0
4    1
Name: Sex, dtype: int32

In [21]:
inputs.head()

   Pclass  Sex   Age     Fare
0       3    1  22.0   7.2500
1       1    0  38.0  71.2833
2       3    0  26.0   7.9250
3       1    0  35.0  53.1000
4       3    1  35.0   8.0500

In [22]:
target.head(5)

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [23]:
df2.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
Fare          0
dtype: int64

In [24]:
mean_age = inputs.Age.mean()
mean_age

29.69911764705882

In [25]:
inputs.Age = inputs.Age.fillna(mean_age)

In [26]:
inputs.isnull().sum()

Pclass    0
Sex       0
Age       0
Fare      0
dtype: int64

In [27]:
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2)

In [28]:
len(X_train)

712

In [29]:
len(X_test)

179

In [30]:
model = tree.DecisionTreeClassifier()

In [31]:
model.fit(X_train,y_train)

DecisionTreeClassifier()

In [32]:
model.score(X_test,y_test)

0.7541899441340782

In [33]:
y_test.head(5)

119    0
722    0
675    0
779    1
685    0
Name: Survived, dtype: int64

In [34]:
X_test.head(5)

     Pclass  Sex   Age      Fare
119       3    0   2.0   31.2750
722       2    1  34.0   13.0000
675       3    1  18.0    7.7750
779       1    0  43.0  211.3375
685       2    1  25.0   41.5792

In [35]:
model.predict(X_test.head(5))

array([0, 0, 0, 1, 0], dtype=int64)